let names = {
    boy: {
        hot: [
            {
                name: '柏宇',
                describe: "柏字用作人名意指细心、坚强、新旺发达之义；宇字指人的风度，仪表，如气宇轩昂；形容男孩风度翩翩、朝气蓬勃、气度不凡。且宇字带有“宀”的字形，是2019属猪人取名适宜用字，代表着丰衣足食，一生不愁吃穿。"
            },
            {
                name: '泽霖',
                describe: "泽指恩泽、恩惠、仁慈的行动，霖指久下不停的雨，两字五行都是属水，有利于运势的提升。寓意男孩温润如玉、福满乾坤、恩泽万世。"
            },
            {
                name: '宸凡',
                describe: "“宸”字本义是指屋檐，深邃的房屋，用作人名里表示尊贵、德高望重的意思；“凡”字原是指铸造器物的模子，后延伸为人名里寓指杰出不凡，优秀卓越，才貌出众之义，并且书写起来也很简单。"
            },
            {
                name: '艺鸣',
                describe: "此名字发音响亮、朗朗上口，有成语“一鸣惊人”的谐音，这样能够加深名字寓意内涵，隐喻男孩子杰出、聪明、勇往直前的特点；从字形结构来说，整体搭配合理，便于书写，并且带有“艹、口”等字形，满足属猪生肖喜用字的查找，有助发展。"
            },
        ],
        list:["卿威", "博文", "笑凯", "彬宸", "宸晓", "忆曦", "驿培", "森硕", "泽凡", "昊杰", "奕丰", "筠心", "朗鸿", "承春", "澍昇", "博升", "雅政", "楷日", "兰志", "煦新", "懿壮", "风抒", "可庆", "星阳", "裕昱", "雄瑜", "文昊", "书鸿", "铭胜", "御瑾", "皓觉", "尉任", "瑞哲", "浠宸", "翌岩", "正成", "松昱", "从勋", "茂碧", "卓梓", "鸿宝", "诚圣", "悟宾", "夏涵", "齐全", "乾烨", "益贤", "迪星", "霖嘉", "峪勇", "择德", "程语", "勤景", "轩晖", "子孝", "亿山", "智德", "祺运", "珲鑫", "以林", "思恒", "睿学", "峰诗", "昆鸿", "楠锋", "言政", "铭元", "国译", "皓俊", "翔诚", "宏元", "翼云", "茂星", "木予", "恩耘", "昭智", "彰振", "凯诚", "锴昆", "烨智", "泽金", "壮佳", "竞瀚", "平卫", "晟维", "卓烨", "之语", "彦义", "盈星", "安民", "和忠", "成会", "庆晋", "捷一", "涛栋", "叙言", "缘思", "伟然", "阳贝", "航承"]
    }
}
let names2 = {
    boy: {
        hot: [
            {
                name: '元柔',
                describe: "依托（元气淋漓）+（温柔敦厚）得来 其中“元”指为首，用于人名也有高贵、显赫、出众之义，“柔”指温柔，是形容性格的字，名字“元柔”指雍容华贵，温文尔雅。"
            },
            {
                name: '妙冉',
                describe: "依托（慧心妙舌）+（冉冉不绝）得来 其中“妙”指巧妙、高超、优秀之义，“冉”指缓慢、从容、淡定、稳重之义，名字“妙冉”指慧心巧思，妙笔生花，从容不迫。"
            },
            {
                name: '美彤',
                describe: "依托（貌美如花）+（玉阶彤庭）得来 其中“美”指的是女子的容貌美丽，漂亮，也指完美，“彤”指活泼、进取、乐观之义，名字“美彤”指天生丽质，尽善尽美，积极向上"
            },
            {
                name: '子文',
                describe: "依托（正人君子）+（文质彬彬）得来 其中“子”指君子，象征为人正直，坚强， 刚毅，有学问，“文”指文静，也指文采，名字“子文”指文思敏捷，才华横溢，刚正不阿"
            },
        ],
        list:["书琴", "曼雁", "雅芙", "以珊", "依萱", "榕嫣", "曦萱", "幻竹", "欣秀", "玲娇", "晓燕", "芬依", "纹静", "静秀", "安茹", "昱瑛", "流丽", "余妍", "梦芝", "雁芙", "雨君", "孟阳", "督琪", "千秋", "南珍", "霞妍", "素晓", "怜雪", "令红", "梦洁", "道芳", "怀梦", "问芙", "铃语", "晓斐", "婳祎", "依琴", "秀琴", "元彤", "雅容", "碧玉", "慕山", "媛娜", "映真", "新颖", "亦瑶", "馨烟", "雅彤", "芝凝", "秋柔", "梦桃", "萱馨", "妍双", "慕梦", "以晴", "忆江", "如柏", "君茹", "代秋", "含海", "代曼", "霞影", "诗云", "玉珍", "芷雪", "觅双", "心月", "悦婷", "白晴", "灵安", "妍羽", "语彤", "惜芹", "沁媛", "以松", "依秋", "珍佳", "妍婷", "千凡"]
    }
}



export {names,names2}